{"success":true,"data":{"web":[{"url":"https://www.amazon.com/Adjustable-Cervical-Sleeping-Ergonomic-Orthopedic/dp/B0C1GQ54QD","title":"Ultra Pain Relief Cooling Pillow for Neck Support, Adjustable ...","description":"Adjustable cervical pillow cozy sleeping, odorless ergonomic contour memory foam pillows, orthopedic bed pillow for side back stomach sleeper.","position":1},{"url":"https://www.amazon.com/Eli-Elm-Organic-Sleeper-Pillow/dp/B07YL7VD32","title":"Eli & Elm | Best Ergonomic Side Sleeper Pillow for Neck Pain ...","description":"Best ergonomic side sleeper pillow for neck pain. Supportive cooling latex fill with luxury breathable cover. U-shape contoured design.","position":2},{"url":"https://www.amazon.com/LoKori-Ergonomic-Cervical-Sleeping-Orthopedic/dp/B0CYT9HXY6","title":"LoKori Ergonomic Side Sleeper Pillows for Adults,Cervical Memory ...","description":"100% Polyester; ▷REDUCE NECK & BACK PAIN: Proven contour design perfectly supports and aligns your head, neck, shoulder, and back. The slope keeps your head ...","position":3},{"url":"https://www.amazon.com/ZJchao-Memory-Ergonomic-Pillow-Sleepers/dp/B0DMWQBCF9","title":"ZJchao Arm Hole Memory Foam Ergonomic Pillow for Side Sleepers","description":"[Skin-friendly Material] Made from soft fabric suitable for all skin types, including sensitive skin, ensuring comfort while you sleep.","position":4},{"url":"https://www.amazon.com/ZZ-WELL-Cooling-Sleeper-Pillow-Ergonomic/dp/B0DK546RKC","title":"ZZ-WELL Cooling Side Sleeper Pillow - Patented Cervical Neck ...","description":"Cooling Side Sleeper Pillow - Patented Cervical Neck Pillow for Sleeping - Ergonomic Curved Memory Foam Pillow for Side Sleepers, Machine Washable Cover (Blue).","position":5},{"url":"https://www.amazon.com/TOPINCN-Orthopedic-Support-Sleeper-Ergonomic/dp/B0DDKXVPXT","title":"TOPINCN Orthopedic Memory Foam Pillow, Neck Support for Side ...","description":"Ergonomic neck pillow: The proven contour design can support and align the head, neck, shoulders and back, providing full support for the entire upper body, ...","position":6},{"url":"https://www.amazon.com/Derila-Cervical-Pillow-Sleeping-Ergonomic/dp/B0F3NTQCYP","title":"Derila Ergo Cervical Neck Pillow for Sleeping Pillow Contour ...","description":"Advanced Memory Foam Pillow – Crafted with high-density foam, this memory foam pillow adjusts to your unique shape for personalized comfort. Pillow for All ...","position":7},{"url":"https://www.amazon.com/Best-Sellers-Neck-Cervical-Pillows/zgbs/home-garden/3732111","title":"Amazon Best Sellers: Best Neck & Cervical Pillows","description":"Cervical Neck Pillow for Pain Relief – Ergonomic Memory Foam Pillow for Side Sleeper Contour Orthopedic Bed Pillow for Neck Support with Cooling Cover ...","position":8}]}}